Tekla Open API Reference for Tekla Structures 2025
BooleanConstantFilterExpression Constructor
Overload List
Name | Description
BooleanConstantFilterExpression(Boolean)
 Initializes a new instance of the BooleanConstantFilterExpression class.
BooleanConstantFilterExpression(Boolean, IFormatProvider)
 Initializes a new instance of the BooleanConstantFilterExpression class.
Top
See Also
Reference
BooleanConstantFilterExpression Class
Tekla.Structures.Filtering Namespace